// 接口字典 类似枚举

// 引导菜单
export const guideMenu = {
	'1': '服务',
	'2': '消息',
	'3': '我的',
	'31': '我的宿舍'
}

// 应聘状态
export const applyState = {
	'0':'已投递',
	'1':'已拒绝',
	'2':'已邀请',
	'3':'待入职',
	'4':'待复试',
	'5':'已入职',
	'6':'已入库'
}

// 操作类型
export const operationType = {
	'1':'邀请面试',
	'2':'拒绝',
	'3':'复试',
	'4':'加入人才库',
	'5':'邀请面试',
	'6':'录取',
	'7':'入职'
}

// 资料类型
export const fileType = {
	'1':'新员工报道',
	'2':'培训资料',
	'3':'考勤规则'
}

// 床位信息
export const bedType = {
	'1': '上铺',
	'2': '下铺'
}

// 来访预约列表类型
export const visitListType = {
	'1': '我发起的预约',
	'2': '待我审批'
}

// 来访预约状态
export const visitState = {
	'0': '已通过',
	'1': '已拒绝',
	'2': '待审核',
	'3': '已到达',
	'4': '超时未到'
}

// 请假 调休 加班 出差 考勤
export const applyStatus = {
	'1': '请假',
	'2': '调休',
	'3': '加班',
	'4': '出差',
	'5': '考勤'
}

// 流程类型
export const processType = {
	'1':'车位申请流程',
	'2':'补卡申请流程',
	'3':'加班申请流程',
	'4':'请假申请流程',
	'5':'调休申请流程',
	'6':'出差申请流程',
	'7':'离职申请流程',
	'8':'离职交接申请流程'
}

// 流程节点状态
export const nodeState = {
	'-1':'未开始',
	'0':'审批中',
	'1':'批准',
	'2':'拒绝'
}

// 离职申请类型
export const dimissionApplyType = {
	'0': '正常',
	'1': '异常'
}

// 审批
export const approveVisitState = {
	'0': '通过',
	'1': '驳回'
}

// 待我审批
export const recordType = {
	'1': '待我审批的',
	'2': '我已审批的'
}

// 链接跳转类型
export const contentLinkType = {
	'1': '自定义URL链接跳转',
	'2': '内容详情页跳转',
	'3': 'APP模块跳转',
}

// 推送消息
export const businessType = {
	'1': '访客',
	'2': '招聘',
	'3': '离职',
	'6': '住宿',
	'7': '请假',
	'8': '调休',
	'9': '加班',
	'10':'考勤',
	'11': '出差'
}